{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForClassifyWithBackDoor"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gpt_emb_dim": 1536,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transform_dropout_rate": 0.0,
  "transform_hidden_size": 1536,
  "transformers_version": "4.44.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
